MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256GU814/mcu.h
#define TRISD TRISD
extern volatile uint16_t TRISD __attribute__((__sfr__));
typedef struct tagTRISDBITS {
  uint16_t TRISD0:1;
  uint16_t TRISD1:1;
  uint16_t TRISD2:1;
  uint16_t TRISD3:1;
  uint16_t TRISD4:1;
  uint16_t TRISD5:1;
  uint16_t TRISD6:1;
  uint16_t TRISD7:1;
  uint16_t TRISD8:1;
  uint16_t TRISD9:1;
  uint16_t TRISD10:1;
  uint16_t TRISD11:1;
  uint16_t TRISD12:1;
  uint16_t TRISD13:1;
  uint16_t TRISD14:1;
  uint16_t TRISD15:1;
} TRISDBITS;
extern volatile TRISDBITS TRISDbits __attribute__((__sfr__));

#define PORTD PORTD
extern volatile uint16_t PORTD __attribute__((__sfr__));
typedef struct tagPORTDBITS {
  uint16_t RD0:1;
  uint16_t RD1:1;
  uint16_t RD2:1;
  uint16_t RD3:1;
  uint16_t RD4:1;
  uint16_t RD5:1;
  uint16_t RD6:1;
  uint16_t RD7:1;
  uint16_t RD8:1;
  uint16_t RD9:1;
  uint16_t RD10:1;
  uint16_t RD11:1;
  uint16_t RD12:1;
  uint16_t RD13:1;
  uint16_t RD14:1;
  uint16_t RD15:1;
} PORTDBITS;
extern volatile PORTDBITS PORTDbits __attribute__((__sfr__));

#define LATD LATD
extern volatile uint16_t LATD __attribute__((__sfr__));
typedef struct tagLATDBITS {
  uint16_t LATD0:1;
  uint16_t LATD1:1;
  uint16_t LATD2:1;
  uint16_t LATD3:1;
  uint16_t LATD4:1;
  uint16_t LATD5:1;
  uint16_t LATD6:1;
  uint16_t LATD7:1;
  uint16_t LATD8:1;
  uint16_t LATD9:1;
  uint16_t LATD10:1;
  uint16_t LATD11:1;
  uint16_t LATD12:1;
  uint16_t LATD13:1;
  uint16_t LATD14:1;
  uint16_t LATD15:1;
} LATDBITS;
extern volatile LATDBITS LATDbits __attribute__((__sfr__));

#define ODCD ODCD
extern volatile uint16_t ODCD __attribute__((__sfr__));
typedef struct tagODCDBITS {
  uint16_t ODCD0:1;
  uint16_t ODCD1:1;
  uint16_t ODCD2:1;
  uint16_t ODCD3:1;
  uint16_t ODCD4:1;
  uint16_t ODCD5:1;
  uint16_t :2;
  uint16_t ODCD8:1;
  uint16_t ODCD9:1;
  uint16_t ODCD10:1;
  uint16_t ODCD11:1;
  uint16_t ODCD12:1;
  uint16_t ODCD13:1;
  uint16_t ODCD14:1;
  uint16_t ODCD15:1;
} ODCDBITS;
extern volatile ODCDBITS ODCDbits __attribute__((__sfr__));

#define CNEND CNEND
extern volatile uint16_t CNEND __attribute__((__sfr__));
typedef struct tagCNENDBITS {
  uint16_t CNIED0:1;
  uint16_t CNIED1:1;
  uint16_t CNIED2:1;
  uint16_t CNIED3:1;
  uint16_t CNIED4:1;
  uint16_t CNIED5:1;
  uint16_t CNIED6:1;
  uint16_t CNIED7:1;
  uint16_t CNIED8:1;
  uint16_t CNIED9:1;
  uint16_t CNIED10:1;
  uint16_t CNIED11:1;
  uint16_t CNIED12:1;
  uint16_t CNIED13:1;
  uint16_t CNIED14:1;
  uint16_t CNIED15:1;
} CNENDBITS;
extern volatile CNENDBITS CNENDbits __attribute__((__sfr__));

#define CNPUD CNPUD
extern volatile uint16_t CNPUD __attribute__((__sfr__));
typedef struct tagCNPUDBITS {
  uint16_t CNPUD0:1;
  uint16_t CNPUD1:1;
  uint16_t CNPUD2:1;
  uint16_t CNPUD3:1;
  uint16_t CNPUD4:1;
  uint16_t CNPUD5:1;
  uint16_t CNPUD6:1;
  uint16_t CNPUD7:1;
  uint16_t CNPUD8:1;
  uint16_t CNPUD9:1;
  uint16_t CNPUD10:1;
  uint16_t CNPUD11:1;
  uint16_t CNPUD12:1;
  uint16_t CNPUD13:1;
  uint16_t CNPUD14:1;
  uint16_t CNPUD15:1;
} CNPUDBITS;
extern volatile CNPUDBITS CNPUDbits __attribute__((__sfr__));

#define CNPDD CNPDD
extern volatile uint16_t CNPDD __attribute__((__sfr__));
typedef struct tagCNPDDBITS {
  uint16_t CNPDD0:1;
  uint16_t CNPDD1:1;
  uint16_t CNPDD2:1;
  uint16_t CNPDD3:1;
  uint16_t CNPDD4:1;
  uint16_t CNPDD5:1;
  uint16_t CNPDD6:1;
  uint16_t CNPDD7:1;
  uint16_t CNPDD8:1;
  uint16_t CNPDD9:1;
  uint16_t CNPDD10:1;
  uint16_t CNPDD11:1;
  uint16_t CNPDD12:1;
  uint16_t CNPDD13:1;
  uint16_t CNPDD14:1;
  uint16_t CNPDD15:1;
} CNPDDBITS;
extern volatile CNPDDBITS CNPDDbits __attribute__((__sfr__));

#define ANSELD ANSELD
extern volatile uint16_t ANSELD __attribute__((__sfr__));
typedef struct tagANSELDBITS {
  uint16_t :6;
  uint16_t ANSD6:1;
  uint16_t ANSD7:1;
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

#define TRISE TRISE
extern volatile uint16_t TRISE __attribute__((__sfr__));
typedef struct tagTRISEBITS {
  uint16_t TRISE0:1;
  uint16_t TRISE1:1;
  uint16_t TRISE2:1;
  uint16_t TRISE3:1;
  uint16_t TRISE4:1;
  uint16_t TRISE5:1;
  uint16_t TRISE6:1;
  uint16_t TRISE7:1;
  uint16_t TRISE8:1;
  uint16_t TRISE9:1;
} TRISEBITS;
extern volatile TRISEBITS TRISEbits __attribute__((__sfr__));

#define PORTE PORTE
extern volatile uint16_t PORTE __attribute__((__sfr__));
typedef struct tagPORTEBITS {
  uint16_t RE0:1;
  uint16_t RE1:1;
  uint16_t RE2:1;
  uint16_t RE3:1;
  uint16_t RE4:1;
  uint16_t RE5:1;
  uint16_t RE6:1;
  uint16_t RE7:1;
  uint16_t RE8:1;
  uint16_t RE9:1;
} PORTEBITS;
extern volatile PORTEBITS PORTEbits __attribute__((__sfr__));

#define LATE LATE
extern volatile uint16_t LATE __attribute__((__sfr__));
typedef struct tagLATEBITS {
  uint16_t LATE0:1;
  uint16_t LATE1:1;
  uint16_t LATE2:1;
  uint16_t LATE3:1;
  uint16_t LATE4:1;
  uint16_t LATE5:1;
  uint16_t LATE6:1;
  uint16_t LATE7:1;
  uint16_t LATE8:1;
  uint16_t LATE9:1;
} LATEBITS;
extern volatile LATEBITS LATEbits __attribute__((__sfr__));

#define CNENE CNENE
extern volatile uint16_t CNENE __attribute__((__sfr__));
typedef struct tagCNENEBITS {
  uint16_t CNIEE0:1;
  uint16_t CNIEE1:1;
  uint16_t CNIEE2:1;
  uint16_t CNIEE3:1;
  uint16_t CNIEE4:1;
  uint16_t CNIEE5:1;
  uint16_t CNIEE6:1;
  uint16_t CNIEE7:1;
  uint16_t CNIEE8:1;
  uint16_t CNIEE9:1;
} CNENEBITS;
extern volatile CNENEBITS CNENEbits __attribute__((__sfr__));

#define CNPUE CNPUE
extern volatile uint16_t CNPUE __attribute__((__sfr__));
typedef struct tagCNPUEBITS {
  uint16_t CNPUE0:1;
  uint16_t CNPUE1:1;
  uint16_t CNPUE2:1;
  uint16_t CNPUE3:1;
  uint16_t CNPUE4:1;
  uint16_t CNPUE5:1;
  uint16_t CNPUE6:1;
  uint16_t CNPUE7:1;
  uint16_t CNPUE8:1;
  uint16_t CNPUE9:1;
} CNPUEBITS;
extern volatile CNPUEBITS CNPUEbits __attribute__((__sfr__));

#define CNPDE CNPDE
extern volatile uint16_t CNPDE __attribute__((__sfr__));
typedef struct tagCNPDEBITS {
  uint16_t CNPDE0:1;
  uint16_t CNPDE1:1;
  uint16_t CNPDE2:1;
  uint16_t CNPDE3:1;
  uint16_t CNPDE4:1;
  uint16_t CNPDE5:1;
  uint16_t CNPDE6:1;
  uint16_t CNPDE7:1;
  uint16_t CNPDE8:1;
  uint16_t CNPDE9:1;
} CNPDEBITS;
extern volatile CNPDEBITS CNPDEbits __attribute__((__sfr__));

#define ANSELE ANSELE
extern volatile uint16_t ANSELE __attribute__((__sfr__));
typedef struct tagANSELEBITS {
  uint16_t ANSE0:1;
  uint16_t ANSE1:1;
  uint16_t ANSE2:1;
  uint16_t ANSE3:1;
  uint16_t ANSE4:1;
  uint16_t ANSE5:1;
  uint16_t ANSE6:1;
  uint16_t ANSE7:1;
  uint16_t ANSE8:1;
  uint16_t ANSE9:1;
} ANSELEBITS;
extern volatile ANSELEBITS ANSELEbits __attribute__((__sfr__));

#define TRISF TRISF
extern volatile uint16_t TRISF __attribute__((__sfr__));
typedef struct tagTRISFBITS {
  uint16_t TRISF0:1;
  uint16_t TRISF1:1;
  uint16_t TRISF2:1;
  uint16_t TRISF3:1;
  uint16_t TRISF4:1;
  uint16_t TRISF5:1;
  uint16_t :2;
  uint16_t TRISF8:1;
  uint16_t :3;
  uint16_t TRISF12:1;
  uint16_t TRISF13:1;
} TRISFBITS;
