MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256GU814/mcu.h
/* ODCD */
#define _ODCD0 ODCDbits.ODCD0
#define _ODCD1 ODCDbits.ODCD1
#define _ODCD2 ODCDbits.ODCD2
#define _ODCD3 ODCDbits.ODCD3
#define _ODCD4 ODCDbits.ODCD4
#define _ODCD5 ODCDbits.ODCD5
#define _ODCD8 ODCDbits.ODCD8
#define _ODCD9 ODCDbits.ODCD9
#define _ODCD10 ODCDbits.ODCD10
#define _ODCD11 ODCDbits.ODCD11
#define _ODCD12 ODCDbits.ODCD12
#define _ODCD13 ODCDbits.ODCD13
#define _ODCD14 ODCDbits.ODCD14
#define _ODCD15 ODCDbits.ODCD15

/* CNEND */
#define _CNIED0 CNENDbits.CNIED0
#define _CNIED1 CNENDbits.CNIED1
#define _CNIED2 CNENDbits.CNIED2
#define _CNIED3 CNENDbits.CNIED3
#define _CNIED4 CNENDbits.CNIED4
#define _CNIED5 CNENDbits.CNIED5
#define _CNIED6 CNENDbits.CNIED6
#define _CNIED7 CNENDbits.CNIED7
#define _CNIED8 CNENDbits.CNIED8
#define _CNIED9 CNENDbits.CNIED9
#define _CNIED10 CNENDbits.CNIED10
#define _CNIED11 CNENDbits.CNIED11
#define _CNIED12 CNENDbits.CNIED12
#define _CNIED13 CNENDbits.CNIED13
#define _CNIED14 CNENDbits.CNIED14
#define _CNIED15 CNENDbits.CNIED15

/* CNPUD */
#define _CNPUD0 CNPUDbits.CNPUD0
#define _CNPUD1 CNPUDbits.CNPUD1
#define _CNPUD2 CNPUDbits.CNPUD2
#define _CNPUD3 CNPUDbits.CNPUD3
#define _CNPUD4 CNPUDbits.CNPUD4
#define _CNPUD5 CNPUDbits.CNPUD5
#define _CNPUD6 CNPUDbits.CNPUD6
#define _CNPUD7 CNPUDbits.CNPUD7
#define _CNPUD8 CNPUDbits.CNPUD8
#define _CNPUD9 CNPUDbits.CNPUD9
#define _CNPUD10 CNPUDbits.CNPUD10
#define _CNPUD11 CNPUDbits.CNPUD11
#define _CNPUD12 CNPUDbits.CNPUD12
#define _CNPUD13 CNPUDbits.CNPUD13
#define _CNPUD14 CNPUDbits.CNPUD14
#define _CNPUD15 CNPUDbits.CNPUD15

/* CNPDD */
#define _CNPDD0 CNPDDbits.CNPDD0
#define _CNPDD1 CNPDDbits.CNPDD1
#define _CNPDD2 CNPDDbits.CNPDD2
#define _CNPDD3 CNPDDbits.CNPDD3
#define _CNPDD4 CNPDDbits.CNPDD4
#define _CNPDD5 CNPDDbits.CNPDD5
#define _CNPDD6 CNPDDbits.CNPDD6
#define _CNPDD7 CNPDDbits.CNPDD7
#define _CNPDD8 CNPDDbits.CNPDD8
#define _CNPDD9 CNPDDbits.CNPDD9
#define _CNPDD10 CNPDDbits.CNPDD10
#define _CNPDD11 CNPDDbits.CNPDD11
#define _CNPDD12 CNPDDbits.CNPDD12
#define _CNPDD13 CNPDDbits.CNPDD13
#define _CNPDD14 CNPDDbits.CNPDD14
#define _CNPDD15 CNPDDbits.CNPDD15

/* ANSELD */
#define _ANSD6 ANSELDbits.ANSD6
#define _ANSD7 ANSELDbits.ANSD7

/* TRISE */
#define _TRISE0 TRISEbits.TRISE0
#define _TRISE1 TRISEbits.TRISE1
#define _TRISE2 TRISEbits.TRISE2
#define _TRISE3 TRISEbits.TRISE3
#define _TRISE4 TRISEbits.TRISE4
#define _TRISE5 TRISEbits.TRISE5
#define _TRISE6 TRISEbits.TRISE6
#define _TRISE7 TRISEbits.TRISE7
#define _TRISE8 TRISEbits.TRISE8
#define _TRISE9 TRISEbits.TRISE9

/* PORTE */
#define _RE0 PORTEbits.RE0
#define _RE1 PORTEbits.RE1
#define _RE2 PORTEbits.RE2
#define _RE3 PORTEbits.RE3
#define _RE4 PORTEbits.RE4
#define _RE5 PORTEbits.RE5
#define _RE6 PORTEbits.RE6
#define _RE7 PORTEbits.RE7
#define _RE8 PORTEbits.RE8
#define _RE9 PORTEbits.RE9

/* LATE */
#define _LATE0 LATEbits.LATE0
#define _LATE1 LATEbits.LATE1
#define _LATE2 LATEbits.LATE2
#define _LATE3 LATEbits.LATE3
#define _LATE4 LATEbits.LATE4
#define _LATE5 LATEbits.LATE5
#define _LATE6 LATEbits.LATE6
#define _LATE7 LATEbits.LATE7
#define _LATE8 LATEbits.LATE8
#define _LATE9 LATEbits.LATE9

/* CNENE */
#define _CNIEE0 CNENEbits.CNIEE0
#define _CNIEE1 CNENEbits.CNIEE1
#define _CNIEE2 CNENEbits.CNIEE2
#define _CNIEE3 CNENEbits.CNIEE3
#define _CNIEE4 CNENEbits.CNIEE4
#define _CNIEE5 CNENEbits.CNIEE5
#define _CNIEE6 CNENEbits.CNIEE6
#define _CNIEE7 CNENEbits.CNIEE7
#define _CNIEE8 CNENEbits.CNIEE8
#define _CNIEE9 CNENEbits.CNIEE9

/* CNPUE */
#define _CNPUE0 CNPUEbits.CNPUE0
#define _CNPUE1 CNPUEbits.CNPUE1
#define _CNPUE2 CNPUEbits.CNPUE2
#define _CNPUE3 CNPUEbits.CNPUE3
#define _CNPUE4 CNPUEbits.CNPUE4
#define _CNPUE5 CNPUEbits.CNPUE5
#define _CNPUE6 CNPUEbits.CNPUE6
#define _CNPUE7 CNPUEbits.CNPUE7
#define _CNPUE8 CNPUEbits.CNPUE8
#define _CNPUE9 CNPUEbits.CNPUE9

/* CNPDE */
#define _CNPDE0 CNPDEbits.CNPDE0
#define _CNPDE1 CNPDEbits.CNPDE1
#define _CNPDE2 CNPDEbits.CNPDE2
#define _CNPDE3 CNPDEbits.CNPDE3
#define _CNPDE4 CNPDEbits.CNPDE4
#define _CNPDE5 CNPDEbits.CNPDE5
#define _CNPDE6 CNPDEbits.CNPDE6
#define _CNPDE7 CNPDEbits.CNPDE7
#define _CNPDE8 CNPDEbits.CNPDE8
#define _CNPDE9 CNPDEbits.CNPDE9

/* ANSELE */
#define _ANSE0 ANSELEbits.ANSE0
#define _ANSE1 ANSELEbits.ANSE1
#define _ANSE2 ANSELEbits.ANSE2
#define _ANSE3 ANSELEbits.ANSE3
#define _ANSE4 ANSELEbits.ANSE4
#define _ANSE5 ANSELEbits.ANSE5
#define _ANSE6 ANSELEbits.ANSE6
#define _ANSE7 ANSELEbits.ANSE7
#define _ANSE8 ANSELEbits.ANSE8
#define _ANSE9 ANSELEbits.ANSE9

/* TRISF */
#define _TRISF0 TRISFbits.TRISF0
#define _TRISF1 TRISFbits.TRISF1
#define _TRISF2 TRISFbits.TRISF2
#define _TRISF3 TRISFbits.TRISF3
#define _TRISF4 TRISFbits.TRISF4
#define _TRISF5 TRISFbits.TRISF5
#define _TRISF8 TRISFbits.TRISF8
#define _TRISF12 TRISFbits.TRISF12
#define _TRISF13 TRISFbits.TRISF13

/* PORTF */
#define _RF0 PORTFbits.RF0
#define _RF1 PORTFbits.RF1
#define _RF2 PORTFbits.RF2
#define _RF3 PORTFbits.RF3
#define _RF4 PORTFbits.RF4
#define _RF5 PORTFbits.RF5
#define _RF8 PORTFbits.RF8
#define _RF12 PORTFbits.RF12
#define _RF13 PORTFbits.RF13

/* LATF */
#define _LATF0 LATFbits.LATF0
#define _LATF1 LATFbits.LATF1
#define _LATF2 LATFbits.LATF2
#define _LATF3 LATFbits.LATF3
#define _LATF4 LATFbits.LATF4
#define _LATF5 LATFbits.LATF5
#define _LATF8 LATFbits.LATF8
#define _LATF12 LATFbits.LATF12
#define _LATF13 LATFbits.LATF13

/* ODCF */
#define _ODCF0 ODCFbits.ODCF0
#define _ODCF1 ODCFbits.ODCF1
#define _ODCF2 ODCFbits.ODCF2
#define _ODCF3 ODCFbits.ODCF3
#define _ODCF4 ODCFbits.ODCF4
#define _ODCF5 ODCFbits.ODCF5
#define _ODCF8 ODCFbits.ODCF8
#define _ODCF12 ODCFbits.ODCF12
#define _ODCF13 ODCFbits.ODCF13

/* CNENF */
#define _CNIEF0 CNENFbits.CNIEF0
#define _CNIEF1 CNENFbits.CNIEF1
#define _CNIEF2 CNENFbits.CNIEF2
#define _CNIEF3 CNENFbits.CNIEF3
#define _CNIEF4 CNENFbits.CNIEF4
#define _CNIEF5 CNENFbits.CNIEF5
#define _CNIEF8 CNENFbits.CNIEF8
#define _CNIEF12 CNENFbits.CNIEF12
#define _CNIEF13 CNENFbits.CNIEF13

/* CNPUF */
#define _CNPUF0 CNPUFbits.CNPUF0
#define _CNPUF1 CNPUFbits.CNPUF1
#define _CNPUF2 CNPUFbits.CNPUF2
#define _CNPUF3 CNPUFbits.CNPUF3
#define _CNPUF4 CNPUFbits.CNPUF4
#define _CNPUF5 CNPUFbits.CNPUF5
#define _CNPUF8 CNPUFbits.CNPUF8
#define _CNPUF12 CNPUFbits.CNPUF12
#define _CNPUF13 CNPUFbits.CNPUF13

/* CNPDF */
#define _CNPDF0 CNPDFbits.CNPDF0
#define _CNPDF1 CNPDFbits.CNPDF1
#define _CNPDF2 CNPDFbits.CNPDF2
#define _CNPDF3 CNPDFbits.CNPDF3
#define _CNPDF4 CNPDFbits.CNPDF4
#define _CNPDF5 CNPDFbits.CNPDF5
#define _CNPDF8 CNPDFbits.CNPDF8
#define _CNPDF12 CNPDFbits.CNPDF12
#define _CNPDF13 CNPDFbits.CNPDF13

/* TRISG */
#define _TRISG0 TRISGbits.TRISG0
#define _TRISG1 TRISGbits.TRISG1
#define _TRISG6 TRISGbits.TRISG6
#define _TRISG7 TRISGbits.TRISG7
#define _TRISG8 TRISGbits.TRISG8
#define _TRISG9 TRISGbits.TRISG9
#define _TRISG12 TRISGbits.TRISG12
#define _TRISG13 TRISGbits.TRISG13
#define _TRISG14 TRISGbits.TRISG14
#define _TRISG15 TRISGbits.TRISG15

/* PORTG */
#define _RG0 PORTGbits.RG0
#define _RG1 PORTGbits.RG1
#define _RG2 PORTGbits.RG2
#define _RG3 PORTGbits.RG3
#define _RG6 PORTGbits.RG6
#define _RG7 PORTGbits.RG7
#define _RG8 PORTGbits.RG8
#define _RG9 PORTGbits.RG9
#define _RG12 PORTGbits.RG12
#define _RG13 PORTGbits.RG13
#define _RG14 PORTGbits.RG14
#define _RG15 PORTGbits.RG15

/* LATG */
#define _LATG0 LATGbits.LATG0
#define _LATG1 LATGbits.LATG1
#define _LATG6 LATGbits.LATG6
#define _LATG7 LATGbits.LATG7
#define _LATG8 LATGbits.LATG8
#define _LATG9 LATGbits.LATG9
#define _LATG12 LATGbits.LATG12
#define _LATG13 LATGbits.LATG13
#define _LATG14 LATGbits.LATG14
#define _LATG15 LATGbits.LATG15

/* ODCG */
#define _ODCG0 ODCGbits.ODCG0
#define _ODCG1 ODCGbits.ODCG1
#define _ODCG12 ODCGbits.ODCG12
#define _ODCG13 ODCGbits.ODCG13
#define _ODCG14 ODCGbits.ODCG14
#define _ODCG15 ODCGbits.ODCG15

/* CNENG */
#define _CNIEG0 CNENGbits.CNIEG0
#define _CNIEG1 CNENGbits.CNIEG1
#define _CNIEG2 CNENGbits.CNIEG2
#define _CNIEG3 CNENGbits.CNIEG3
#define _CNIEG6 CNENGbits.CNIEG6
#define _CNIEG7 CNENGbits.CNIEG7
#define _CNIEG8 CNENGbits.CNIEG8
#define _CNIEG9 CNENGbits.CNIEG9
#define _CNIEG12 CNENGbits.CNIEG12
#define _CNIEG13 CNENGbits.CNIEG13
#define _CNIEG14 CNENGbits.CNIEG14
#define _CNIEG15 CNENGbits.CNIEG15

