MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256GU814/mcu.h
#define _RPOR11_RP104R2_POSITION                 0x00000002
#define _RPOR11_RP104R2_MASK                     0x00000004
#define _RPOR11_RP104R2_LENGTH                   0x00000001

#define _RPOR11_RP104R3_POSITION                 0x00000003
#define _RPOR11_RP104R3_MASK                     0x00000008
#define _RPOR11_RP104R3_LENGTH                   0x00000001

#define _RPOR11_RP104R4_POSITION                 0x00000004
#define _RPOR11_RP104R4_MASK                     0x00000010
#define _RPOR11_RP104R4_LENGTH                   0x00000001

#define _RPOR11_RP104R5_POSITION                 0x00000005
#define _RPOR11_RP104R5_MASK                     0x00000020
#define _RPOR11_RP104R5_LENGTH                   0x00000001

#define _RPOR11_RP108R0_POSITION                 0x00000008
#define _RPOR11_RP108R0_MASK                     0x00000100
#define _RPOR11_RP108R0_LENGTH                   0x00000001

#define _RPOR11_RP108R1_POSITION                 0x00000009
#define _RPOR11_RP108R1_MASK                     0x00000200
#define _RPOR11_RP108R1_LENGTH                   0x00000001

#define _RPOR11_RP108R2_POSITION                 0x0000000A
#define _RPOR11_RP108R2_MASK                     0x00000400
#define _RPOR11_RP108R2_LENGTH                   0x00000001

#define _RPOR11_RP108R3_POSITION                 0x0000000B
#define _RPOR11_RP108R3_MASK                     0x00000800
#define _RPOR11_RP108R3_LENGTH                   0x00000001

#define _RPOR11_RP108R4_POSITION                 0x0000000C
#define _RPOR11_RP108R4_MASK                     0x00001000
#define _RPOR11_RP108R4_LENGTH                   0x00000001

#define _RPOR11_RP108R5_POSITION                 0x0000000D
#define _RPOR11_RP108R5_MASK                     0x00002000
#define _RPOR11_RP108R5_LENGTH                   0x00000001

#define _RPOR12_RP109R_POSITION                  0x00000000
#define _RPOR12_RP109R_MASK                      0x0000003F
#define _RPOR12_RP109R_LENGTH                    0x00000006

#define _RPOR12_RP112R_POSITION                  0x00000008
#define _RPOR12_RP112R_MASK                      0x00003F00
#define _RPOR12_RP112R_LENGTH                    0x00000006

#define _RPOR12_RP109R0_POSITION                 0x00000000
#define _RPOR12_RP109R0_MASK                     0x00000001
#define _RPOR12_RP109R0_LENGTH                   0x00000001

#define _RPOR12_RP109R1_POSITION                 0x00000001
#define _RPOR12_RP109R1_MASK                     0x00000002
#define _RPOR12_RP109R1_LENGTH                   0x00000001

#define _RPOR12_RP109R2_POSITION                 0x00000002
#define _RPOR12_RP109R2_MASK                     0x00000004
#define _RPOR12_RP109R2_LENGTH                   0x00000001

#define _RPOR12_RP109R3_POSITION                 0x00000003
#define _RPOR12_RP109R3_MASK                     0x00000008
#define _RPOR12_RP109R3_LENGTH                   0x00000001

#define _RPOR12_RP109R4_POSITION                 0x00000004
#define _RPOR12_RP109R4_MASK                     0x00000010
#define _RPOR12_RP109R4_LENGTH                   0x00000001

#define _RPOR12_RP109R5_POSITION                 0x00000005
#define _RPOR12_RP109R5_MASK                     0x00000020
#define _RPOR12_RP109R5_LENGTH                   0x00000001

#define _RPOR12_RP112R0_POSITION                 0x00000008
#define _RPOR12_RP112R0_MASK                     0x00000100
#define _RPOR12_RP112R0_LENGTH                   0x00000001

#define _RPOR12_RP112R1_POSITION                 0x00000009
#define _RPOR12_RP112R1_MASK                     0x00000200
#define _RPOR12_RP112R1_LENGTH                   0x00000001

#define _RPOR12_RP112R2_POSITION                 0x0000000A
#define _RPOR12_RP112R2_MASK                     0x00000400
#define _RPOR12_RP112R2_LENGTH                   0x00000001

#define _RPOR12_RP112R3_POSITION                 0x0000000B
#define _RPOR12_RP112R3_MASK                     0x00000800
#define _RPOR12_RP112R3_LENGTH                   0x00000001

#define _RPOR12_RP112R4_POSITION                 0x0000000C
#define _RPOR12_RP112R4_MASK                     0x00001000
#define _RPOR12_RP112R4_LENGTH                   0x00000001

#define _RPOR12_RP112R5_POSITION                 0x0000000D
#define _RPOR12_RP112R5_MASK                     0x00002000
#define _RPOR12_RP112R5_LENGTH                   0x00000001

#define _RPOR13_RP113R_POSITION                  0x00000000
#define _RPOR13_RP113R_MASK                      0x0000003F
#define _RPOR13_RP113R_LENGTH                    0x00000006

#define _RPOR13_RP118R_POSITION                  0x00000008
#define _RPOR13_RP118R_MASK                      0x00003F00
#define _RPOR13_RP118R_LENGTH                    0x00000006

#define _RPOR13_RP113R0_POSITION                 0x00000000
#define _RPOR13_RP113R0_MASK                     0x00000001
#define _RPOR13_RP113R0_LENGTH                   0x00000001

#define _RPOR13_RP113R1_POSITION                 0x00000001
#define _RPOR13_RP113R1_MASK                     0x00000002
#define _RPOR13_RP113R1_LENGTH                   0x00000001

#define _RPOR13_RP113R2_POSITION                 0x00000002
#define _RPOR13_RP113R2_MASK                     0x00000004
#define _RPOR13_RP113R2_LENGTH                   0x00000001

#define _RPOR13_RP113R3_POSITION                 0x00000003
#define _RPOR13_RP113R3_MASK                     0x00000008
#define _RPOR13_RP113R3_LENGTH                   0x00000001

#define _RPOR13_RP113R4_POSITION                 0x00000004
#define _RPOR13_RP113R4_MASK                     0x00000010
#define _RPOR13_RP113R4_LENGTH                   0x00000001

#define _RPOR13_RP113R5_POSITION                 0x00000005
#define _RPOR13_RP113R5_MASK                     0x00000020
#define _RPOR13_RP113R5_LENGTH                   0x00000001

#define _RPOR13_RP118R0_POSITION                 0x00000008
#define _RPOR13_RP118R0_MASK                     0x00000100
#define _RPOR13_RP118R0_LENGTH                   0x00000001

#define _RPOR13_RP118R1_POSITION                 0x00000009
#define _RPOR13_RP118R1_MASK                     0x00000200
#define _RPOR13_RP118R1_LENGTH                   0x00000001

#define _RPOR13_RP118R2_POSITION                 0x0000000A
#define _RPOR13_RP118R2_MASK                     0x00000400
#define _RPOR13_RP118R2_LENGTH                   0x00000001

#define _RPOR13_RP118R3_POSITION                 0x0000000B
#define _RPOR13_RP118R3_MASK                     0x00000800
#define _RPOR13_RP118R3_LENGTH                   0x00000001

#define _RPOR13_RP118R4_POSITION                 0x0000000C
#define _RPOR13_RP118R4_MASK                     0x00001000
#define _RPOR13_RP118R4_LENGTH                   0x00000001

#define _RPOR13_RP118R5_POSITION                 0x0000000D
#define _RPOR13_RP118R5_MASK                     0x00002000
#define _RPOR13_RP118R5_LENGTH                   0x00000001

#define _RPOR14_RP120R_POSITION                  0x00000000
#define _RPOR14_RP120R_MASK                      0x0000003F
#define _RPOR14_RP120R_LENGTH                    0x00000006

#define _RPOR14_RP125R_POSITION                  0x00000008
#define _RPOR14_RP125R_MASK                      0x00003F00
#define _RPOR14_RP125R_LENGTH                    0x00000006

#define _RPOR14_RP120R0_POSITION                 0x00000000
#define _RPOR14_RP120R0_MASK                     0x00000001
#define _RPOR14_RP120R0_LENGTH                   0x00000001

#define _RPOR14_RP120R1_POSITION                 0x00000001
#define _RPOR14_RP120R1_MASK                     0x00000002
#define _RPOR14_RP120R1_LENGTH                   0x00000001

#define _RPOR14_RP120R2_POSITION                 0x00000002
#define _RPOR14_RP120R2_MASK                     0x00000004
#define _RPOR14_RP120R2_LENGTH                   0x00000001

