MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256GU814/mcu.h
#define _DMAPWC_PWCOL8_POSITION                  0x00000008
#define _DMAPWC_PWCOL8_MASK                      0x00000100
#define _DMAPWC_PWCOL8_LENGTH                    0x00000001

#define _DMAPWC_PWCOL9_POSITION                  0x00000009
#define _DMAPWC_PWCOL9_MASK                      0x00000200
#define _DMAPWC_PWCOL9_LENGTH                    0x00000001

#define _DMAPWC_PWCOL10_POSITION                 0x0000000A
#define _DMAPWC_PWCOL10_MASK                     0x00000400
#define _DMAPWC_PWCOL10_LENGTH                   0x00000001

#define _DMAPWC_PWCOL11_POSITION                 0x0000000B
#define _DMAPWC_PWCOL11_MASK                     0x00000800
#define _DMAPWC_PWCOL11_LENGTH                   0x00000001

#define _DMAPWC_PWCOL12_POSITION                 0x0000000C
#define _DMAPWC_PWCOL12_MASK                     0x00001000
#define _DMAPWC_PWCOL12_LENGTH                   0x00000001

#define _DMAPWC_PWCOL13_POSITION                 0x0000000D
#define _DMAPWC_PWCOL13_MASK                     0x00002000
#define _DMAPWC_PWCOL13_LENGTH                   0x00000001

#define _DMAPWC_PWCOL14_POSITION                 0x0000000E
#define _DMAPWC_PWCOL14_MASK                     0x00004000
#define _DMAPWC_PWCOL14_LENGTH                   0x00000001

#define _DMARQC_RQCOL0_POSITION                  0x00000000
#define _DMARQC_RQCOL0_MASK                      0x00000001
#define _DMARQC_RQCOL0_LENGTH                    0x00000001

#define _DMARQC_RQCOL1_POSITION                  0x00000001
#define _DMARQC_RQCOL1_MASK                      0x00000002
#define _DMARQC_RQCOL1_LENGTH                    0x00000001

#define _DMARQC_RQCOL2_POSITION                  0x00000002
#define _DMARQC_RQCOL2_MASK                      0x00000004
#define _DMARQC_RQCOL2_LENGTH                    0x00000001

#define _DMARQC_RQCOL3_POSITION                  0x00000003
#define _DMARQC_RQCOL3_MASK                      0x00000008
#define _DMARQC_RQCOL3_LENGTH                    0x00000001

#define _DMARQC_RQCOL4_POSITION                  0x00000004
#define _DMARQC_RQCOL4_MASK                      0x00000010
#define _DMARQC_RQCOL4_LENGTH                    0x00000001

#define _DMARQC_RQCOL5_POSITION                  0x00000005
#define _DMARQC_RQCOL5_MASK                      0x00000020
#define _DMARQC_RQCOL5_LENGTH                    0x00000001

#define _DMARQC_RQCOL6_POSITION                  0x00000006
#define _DMARQC_RQCOL6_MASK                      0x00000040
#define _DMARQC_RQCOL6_LENGTH                    0x00000001

#define _DMARQC_RQCOL7_POSITION                  0x00000007
#define _DMARQC_RQCOL7_MASK                      0x00000080
#define _DMARQC_RQCOL7_LENGTH                    0x00000001

#define _DMARQC_RQCOL8_POSITION                  0x00000008
#define _DMARQC_RQCOL8_MASK                      0x00000100
#define _DMARQC_RQCOL8_LENGTH                    0x00000001

#define _DMARQC_RQCOL9_POSITION                  0x00000009
#define _DMARQC_RQCOL9_MASK                      0x00000200
#define _DMARQC_RQCOL9_LENGTH                    0x00000001

#define _DMARQC_RQCOL10_POSITION                 0x0000000A
#define _DMARQC_RQCOL10_MASK                     0x00000400
#define _DMARQC_RQCOL10_LENGTH                   0x00000001

#define _DMARQC_RQCOL11_POSITION                 0x0000000B
#define _DMARQC_RQCOL11_MASK                     0x00000800
#define _DMARQC_RQCOL11_LENGTH                   0x00000001

#define _DMARQC_RQCOL12_POSITION                 0x0000000C
#define _DMARQC_RQCOL12_MASK                     0x00001000
#define _DMARQC_RQCOL12_LENGTH                   0x00000001

#define _DMARQC_RQCOL13_POSITION                 0x0000000D
#define _DMARQC_RQCOL13_MASK                     0x00002000
#define _DMARQC_RQCOL13_LENGTH                   0x00000001

#define _DMARQC_RQCOL14_POSITION                 0x0000000E
#define _DMARQC_RQCOL14_MASK                     0x00004000
#define _DMARQC_RQCOL14_LENGTH                   0x00000001

#define _DMAPPS_PPST0_POSITION                   0x00000000
#define _DMAPPS_PPST0_MASK                       0x00000001
#define _DMAPPS_PPST0_LENGTH                     0x00000001

#define _DMAPPS_PPST1_POSITION                   0x00000001
#define _DMAPPS_PPST1_MASK                       0x00000002
#define _DMAPPS_PPST1_LENGTH                     0x00000001

#define _DMAPPS_PPST2_POSITION                   0x00000002
#define _DMAPPS_PPST2_MASK                       0x00000004
#define _DMAPPS_PPST2_LENGTH                     0x00000001

#define _DMAPPS_PPST3_POSITION                   0x00000003
#define _DMAPPS_PPST3_MASK                       0x00000008
#define _DMAPPS_PPST3_LENGTH                     0x00000001

#define _DMAPPS_PPST4_POSITION                   0x00000004
#define _DMAPPS_PPST4_MASK                       0x00000010
#define _DMAPPS_PPST4_LENGTH                     0x00000001

#define _DMAPPS_PPST5_POSITION                   0x00000005
#define _DMAPPS_PPST5_MASK                       0x00000020
#define _DMAPPS_PPST5_LENGTH                     0x00000001

#define _DMAPPS_PPST6_POSITION                   0x00000006
#define _DMAPPS_PPST6_MASK                       0x00000040
#define _DMAPPS_PPST6_LENGTH                     0x00000001

#define _DMAPPS_PPST7_POSITION                   0x00000007
#define _DMAPPS_PPST7_MASK                       0x00000080
#define _DMAPPS_PPST7_LENGTH                     0x00000001

#define _DMAPPS_PPST8_POSITION                   0x00000008
#define _DMAPPS_PPST8_MASK                       0x00000100
#define _DMAPPS_PPST8_LENGTH                     0x00000001

#define _DMAPPS_PPST9_POSITION                   0x00000009
#define _DMAPPS_PPST9_MASK                       0x00000200
#define _DMAPPS_PPST9_LENGTH                     0x00000001

#define _DMAPPS_PPST10_POSITION                  0x0000000A
#define _DMAPPS_PPST10_MASK                      0x00000400
#define _DMAPPS_PPST10_LENGTH                    0x00000001

#define _DMAPPS_PPST11_POSITION                  0x0000000B
#define _DMAPPS_PPST11_MASK                      0x00000800
#define _DMAPPS_PPST11_LENGTH                    0x00000001

#define _DMAPPS_PPST12_POSITION                  0x0000000C
#define _DMAPPS_PPST12_MASK                      0x00001000
#define _DMAPPS_PPST12_LENGTH                    0x00000001

