MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256GU814/mcu.h
#define _CNPUH_CNPUH1_POSITION                   0x00000001
#define _CNPUH_CNPUH1_MASK                       0x00000002
#define _CNPUH_CNPUH1_LENGTH                     0x00000001

#define _CNPUH_CNPUH2_POSITION                   0x00000002
#define _CNPUH_CNPUH2_MASK                       0x00000004
#define _CNPUH_CNPUH2_LENGTH                     0x00000001

#define _CNPUH_CNPUH3_POSITION                   0x00000003
#define _CNPUH_CNPUH3_MASK                       0x00000008
#define _CNPUH_CNPUH3_LENGTH                     0x00000001

#define _CNPUH_CNPUH4_POSITION                   0x00000004
#define _CNPUH_CNPUH4_MASK                       0x00000010
#define _CNPUH_CNPUH4_LENGTH                     0x00000001

#define _CNPUH_CNPUH5_POSITION                   0x00000005
#define _CNPUH_CNPUH5_MASK                       0x00000020
#define _CNPUH_CNPUH5_LENGTH                     0x00000001

#define _CNPUH_CNPUH6_POSITION                   0x00000006
#define _CNPUH_CNPUH6_MASK                       0x00000040
#define _CNPUH_CNPUH6_LENGTH                     0x00000001

#define _CNPUH_CNPUH7_POSITION                   0x00000007
#define _CNPUH_CNPUH7_MASK                       0x00000080
#define _CNPUH_CNPUH7_LENGTH                     0x00000001

#define _CNPUH_CNPUH8_POSITION                   0x00000008
#define _CNPUH_CNPUH8_MASK                       0x00000100
#define _CNPUH_CNPUH8_LENGTH                     0x00000001

#define _CNPUH_CNPUH9_POSITION                   0x00000009
#define _CNPUH_CNPUH9_MASK                       0x00000200
#define _CNPUH_CNPUH9_LENGTH                     0x00000001

#define _CNPUH_CNPUH10_POSITION                  0x0000000A
#define _CNPUH_CNPUH10_MASK                      0x00000400
#define _CNPUH_CNPUH10_LENGTH                    0x00000001

#define _CNPUH_CNPUH11_POSITION                  0x0000000B
#define _CNPUH_CNPUH11_MASK                      0x00000800
#define _CNPUH_CNPUH11_LENGTH                    0x00000001

#define _CNPUH_CNPUH12_POSITION                  0x0000000C
#define _CNPUH_CNPUH12_MASK                      0x00001000
#define _CNPUH_CNPUH12_LENGTH                    0x00000001

#define _CNPUH_CNPUH13_POSITION                  0x0000000D
#define _CNPUH_CNPUH13_MASK                      0x00002000
#define _CNPUH_CNPUH13_LENGTH                    0x00000001

#define _CNPUH_CNPUH14_POSITION                  0x0000000E
#define _CNPUH_CNPUH14_MASK                      0x00004000
#define _CNPUH_CNPUH14_LENGTH                    0x00000001

#define _CNPUH_CNPUH15_POSITION                  0x0000000F
#define _CNPUH_CNPUH15_MASK                      0x00008000
#define _CNPUH_CNPUH15_LENGTH                    0x00000001

#define _CNPDH_CNPDH0_POSITION                   0x00000000
#define _CNPDH_CNPDH0_MASK                       0x00000001
#define _CNPDH_CNPDH0_LENGTH                     0x00000001

#define _CNPDH_CNPDH1_POSITION                   0x00000001
#define _CNPDH_CNPDH1_MASK                       0x00000002
#define _CNPDH_CNPDH1_LENGTH                     0x00000001

#define _CNPDH_CNPDH2_POSITION                   0x00000002
#define _CNPDH_CNPDH2_MASK                       0x00000004
#define _CNPDH_CNPDH2_LENGTH                     0x00000001

#define _CNPDH_CNPDH3_POSITION                   0x00000003
#define _CNPDH_CNPDH3_MASK                       0x00000008
#define _CNPDH_CNPDH3_LENGTH                     0x00000001

#define _CNPDH_CNPDH4_POSITION                   0x00000004
#define _CNPDH_CNPDH4_MASK                       0x00000010
#define _CNPDH_CNPDH4_LENGTH                     0x00000001

#define _CNPDH_CNPDH5_POSITION                   0x00000005
#define _CNPDH_CNPDH5_MASK                       0x00000020
#define _CNPDH_CNPDH5_LENGTH                     0x00000001

#define _CNPDH_CNPDH6_POSITION                   0x00000006
#define _CNPDH_CNPDH6_MASK                       0x00000040
#define _CNPDH_CNPDH6_LENGTH                     0x00000001

#define _CNPDH_CNPDH7_POSITION                   0x00000007
#define _CNPDH_CNPDH7_MASK                       0x00000080
#define _CNPDH_CNPDH7_LENGTH                     0x00000001

#define _CNPDH_CNPDH8_POSITION                   0x00000008
#define _CNPDH_CNPDH8_MASK                       0x00000100
#define _CNPDH_CNPDH8_LENGTH                     0x00000001

#define _CNPDH_CNPDH9_POSITION                   0x00000009
#define _CNPDH_CNPDH9_MASK                       0x00000200
#define _CNPDH_CNPDH9_LENGTH                     0x00000001

#define _CNPDH_CNPDH10_POSITION                  0x0000000A
#define _CNPDH_CNPDH10_MASK                      0x00000400
#define _CNPDH_CNPDH10_LENGTH                    0x00000001

#define _CNPDH_CNPDH11_POSITION                  0x0000000B
#define _CNPDH_CNPDH11_MASK                      0x00000800
#define _CNPDH_CNPDH11_LENGTH                    0x00000001

#define _CNPDH_CNPDH12_POSITION                  0x0000000C
#define _CNPDH_CNPDH12_MASK                      0x00001000
#define _CNPDH_CNPDH12_LENGTH                    0x00000001

#define _CNPDH_CNPDH13_POSITION                  0x0000000D
#define _CNPDH_CNPDH13_MASK                      0x00002000
#define _CNPDH_CNPDH13_LENGTH                    0x00000001

#define _CNPDH_CNPDH14_POSITION                  0x0000000E
#define _CNPDH_CNPDH14_MASK                      0x00004000
#define _CNPDH_CNPDH14_LENGTH                    0x00000001

#define _CNPDH_CNPDH15_POSITION                  0x0000000F
#define _CNPDH_CNPDH15_MASK                      0x00008000
#define _CNPDH_CNPDH15_LENGTH                    0x00000001

#define _TRISJ_TRISJ0_POSITION                   0x00000000
#define _TRISJ_TRISJ0_MASK                       0x00000001
#define _TRISJ_TRISJ0_LENGTH                     0x00000001

#define _TRISJ_TRISJ1_POSITION                   0x00000001
#define _TRISJ_TRISJ1_MASK                       0x00000002
#define _TRISJ_TRISJ1_LENGTH                     0x00000001

#define _TRISJ_TRISJ2_POSITION                   0x00000002
#define _TRISJ_TRISJ2_MASK                       0x00000004
#define _TRISJ_TRISJ2_LENGTH                     0x00000001

